app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_classes_params(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-01-10 06:09:53.630621"], ["updated_at", "2019-01-10 06:09:53.630621"]]